In [2]:
import pandas as pd
import numpy as np
from scipy import stats

/usr/lib/python3/dist-packages/scipy/__init__.py:146: UserWarning: A NumPy version >=1.17.3 and <1.25.0 is required for this version of SciPy (detected version 1.25.2
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [3]:
academic_performance = [[1,'Sarthak',36,62], [2,'Ketan',87,45], [3,'Lahu',32,21], [4,'Yash',69,76], [5,'Atharva',20,80], [6,'Rohan',10,], [7,'Aniket',49,]]

In [4]:
df = pd.DataFrame(academic_performance, columns=["Roll_No","Name","Subject 1", "Subject 2"])

In [5]:
df

   Roll_No     Name  Subject 1  Subject 2
0        1  Sarthak         36       62.0
1        2    Ketan         87       45.0
2        3     Lahu         32       21.0
3        4     Yash         69       76.0
4        5  Atharva         20       80.0
5        6    Rohan         10        NaN
6        7   Aniket         49        NaN

In [6]:
df = df.fillna(0)

In [7]:
z = np.abs(stats.zscore(df['Subject 1']))
z

0    0.289437
1    1.736619
2    0.448343
3    1.021541
4    0.925062
5    1.322328
6    0.227009
Name: Subject 1, dtype: float64

In [8]:
df

   Roll_No     Name  Subject 1  Subject 2
0        1  Sarthak         36       62.0
1        2    Ketan         87       45.0
2        3     Lahu         32       21.0
3        4     Yash         69       76.0
4        5  Atharva         20       80.0
5        6    Rohan         10        0.0
6        7   Aniket         49        0.0

In [9]:
outlier_indices = np.where(z > 2)[0]
df = df.drop(outlier_indices)

In [10]:
df

   Roll_No     Name  Subject 1  Subject 2
0        1  Sarthak         36       62.0
1        2    Ketan         87       45.0
2        3     Lahu         32       21.0
3        4     Yash         69       76.0
4        5  Atharva         20       80.0
5        6    Rohan         10        0.0
6        7   Aniket         49        0.0

In [11]:
df['Subject 1'] = np.log1p(df['Subject 1'])

In [12]:
df

   Roll_No     Name  Subject 1  Subject 2
0        1  Sarthak   3.610918       62.0
1        2    Ketan   4.477337       45.0
2        3     Lahu   3.496508       21.0
3        4     Yash   4.248495       76.0
4        5  Atharva   3.044522       80.0
5        6    Rohan   2.397895        0.0
6        7   Aniket   3.912023        0.0